exports.eightCharBanHe = [ [ "亥卯", "半合", "生地半合" ], [ "寅午", "半合", "生地半合" ], [ "申子", "半合", "生地半合" ], [ "巳酉", "半合", "生地半合" ], [ "子辰", "半合", "墓地半合" ], [ "卯未", "半合", "墓地半合" ], [ "午戌", "半合", "墓地半合" ], [ "酉丑", "半合", "墓地半合" ] ], 
exports.eightCharGonHe = [ [ "丑卯", "拱合" ], [ "辰午", "拱合" ], [ "未酉", "拱合" ], [ "戌子", "拱合" ] ], 
exports.eightCharHai = [ [ "子未", "相害" ], [ "丑午", "相害" ], [ "寅巳", "相害" ], [ "卯辰", "相害" ], [ "申亥", "相害" ], [ "酉戌", "相害" ] ], 
exports.eightCharLiuHe = [ [ "子丑", "六合", "合化土" ], [ "寅亥", "六合(破合)", "合化木" ], [ "卯戌", "六合", "合化火" ], [ "辰酉", "六合", "合化金" ], [ "巳申", "六合(刑合)", "合化水" ], [ "午未", "六合", "合化土" ] ], 
exports.eightCharPo = [ [ "子酉", "六破" ], [ "卯午", "六破" ], [ "辰丑", "六破" ], [ "未戌", "六破" ], [ "寅亥", "六破(破合)" ], [ "巳申", "六破" ] ], 
exports.eightCharXing = [ [ "子卯", "相刑" ], [ "辰辰", "相刑" ], [ "午午", "相刑" ], [ "酉酉", "相刑" ], [ "亥亥", "相刑" ] ], 
exports.heavenStemChon = [ [ "甲庚", "相冲" ], [ "乙辛", "相冲" ], [ "丙壬", "相冲" ], [ "丁癸", "相冲" ], [ "戊己", "相冲" ] ], 
exports.heavenStemHe = [ [ "甲己", "五合", "合化土" ], [ "乙庚", "五合", "合化金" ], [ "丙辛", "五合", "合化水" ], [ "丁壬", "五合", "合化木" ], [ "戊癸", "五合", "合化火" ] ], 
exports.heavenStemKe = [ [ "甲戊", "相克" ], [ "己癸", "相克" ], [ "乙已", "相克" ], [ "庚甲", "相克" ], [ "丙庚", "相克" ], [ "辛乙", "相克" ], [ "丁辛", "相克" ], [ "壬丙", "相克" ], [ "戊壬", "相克" ], [ "癸丁", "相克" ] ], 
exports.jiriList = [ {
    name: "热门",
    list: [ {
        name: "嫁娶",
        remark: "嫁娶是指男娶女嫁,举行大典的吉日"
    }, {
        name: "开市",
        remark: "指新店或新厂开业，以及年初头一天开工或门店开门做生意"
    }, {
        name: "置产",
        remark: "指购置房产、地产或其他固定资产"
    }, {
        name: "入宅",
        remark: "指某人搬入新居，也就是搬到新建的房屋内住"
    }, {
        name: "出行",
        remark: "‌指外出旅行或办事。通常在黄历中选择适宜出行的吉日，以求旅途平安、顺利。"
    }, {
        name: "会亲友",
        remark: "访问或接见亲朋戚友。某些日子可能特别适宜亲友间的聚会，以增进感情"
    }, {
        name: "归宁",
        remark: "‌归宁，指的是出嫁的女子在新婚后返回娘家的日子，也被称为“回门”"
    }, {
        name: "祈福",
        remark: "‌指向神灵祈求幸福、安康等美好愿望的活动。"
    } ]
}, {
    name: "婚姻",
    list: [ {
        name: "嫁娶",
        remark: "嫁娶是指男娶女嫁,举行大典的吉日"
    }, {
        name: "安床",
        remark: "安床是指指安置睡床卧铺之意"
    }, {
        name: "纳彩",
        remark: "‌同结婚姻，受授聘金，也就是下聘礼"
    }, {
        name: "问明",
        remark: "‌问名‌是六礼中的第二礼，指在纳采之后，男方通过媒人询问女方的名字、生辰八字等信息"
    }, {
        name: "纳婿",
        remark: "‌纳婿‌指男方入赘于女方为婿之意。同嫁娶"
    }, {
        name: "订盟",
        remark: "‌指双方正式达成协议或订立某种契约，可能涉及婚姻或商业合作的初步协议"
    }, {
        name: "归宁",
        remark: "‌归宁，指的是出嫁的女子在新婚后返回娘家的日子，也被称为“回门”"
    }, {
        name: "合帐",
        remark: "制作蚊帐之事，今应指安置窗帘"
    }, {
        name: "盖屋",
        remark: "‌指建造或修缮房屋，包括装盖房屋的屋顶等工作"
    } ]
}, {
    name: "生活",
    list: [ {
        name: "会亲友",
        remark: "访问或接见亲朋戚友。某些日子可能特别适宜亲友间的聚会，以增进感情"
    }, {
        name: "扫舍",
        remark: "选择适宜的日子进行大扫除，有助于净化家居环境，带来好运"
    }, {
        name: "入学",
        remark: "‌通常指开始接受教育或进入新的学习阶段。适宜入学的吉日，以求学业有成"
    }, {
        name: "伐木",
        remark: "‌砍伐树木制作屋顶梁木等事。在黄历中，选择吉日伐木，有助于顺利完成工程并带来好运。"
    }, {
        name: "出行",
        remark: "‌指‌指外出旅行或办事。通常在黄历中选择适宜出行的吉日，以求旅途平安、顺利。"
    }, {
        name: "理发",
        remark: "‌修剪头发。在传统文化中，理发有时也被视为一种仪式，选择吉日理发有助于带来好运和新的开始。"
    }, {
        name: "栽种",
        remark: "‌种植植物或农作物。在黄历中，适宜栽种的日子通常与节气和土壤条件等因素相关，选择吉日栽种有助于提高农作物的产量和质量"
    }, {
        name: "针灸",
        remark: "一种古老的中医疗法，通过在特定的穴位上插入针来调理人体的气血，以达到治疗疾病的目的"
    }, {
        name: "习艺",
        remark: "学习技艺或技能。在黄历中，某些日子可能特别适宜开始学习新的技艺或技能，以求技艺精进。"
    }, {
        name: "求医",
        remark: "指寻求医疗帮助或治疗疾病。在黄历中，适宜求医的日子可能与节气、时辰以及个人运势等因素相关"
    }, {
        name: "移徙",
        remark: "指搬家迁移住所。在黄历中，选择适宜的日子搬家有助于带来好运和顺利的生活。"
    }, {
        name: "进人口",
        remark: "在黄历中，进人口通常指收纳养子女或增加家庭成员。选择吉日进人口有助于家庭和谐、幸福。"
    } ]
}, {
    name: "工商",
    list: [ {
        name: "开市",
        remark: "指新店或新厂开业，以及年初头一天开工或门店开门做生意"
    }, {
        name: "赴任",
        remark: "适宜赴任的日子，通常被认为能够带来事业上的顺利和成功"
    }, {
        name: "立券",
        remark: "‌指订立契约之事，即订立合同。在黄历中，立券代表着交易、订立各种契约互相买卖的意思"
    }, {
        name: "开仓",
        remark: "‌适宜货财，即商贾之出货、销货、放债的日子可能意味着能够带来财富的增长"
    }, {
        name: "订盟",
        remark: "‌指双方正式达成协议或订立某种契约，可能涉及婚姻或商业合作的初步协议"
    }, {
        name: "交易",
        remark: "‌指买卖、商业活动或财产转让等经济行为,适宜交易的日子可能意味着能够带来商业上的成功和财富的增长"
    }, {
        name: "出货财",
        remark: "‌与开仓类似，指出售货物或财产。"
    }, {
        name: "纳财",
        remark: "指已属于自己的财富基础上购置产业、进货、收帐、收租、讨债、贷款、五谷入仓等"
    }, {
        name: "置产",
        remark: "指购置房产、地产或其他固定资产"
    } ]
}, {
    name: "建筑",
    list: [ {
        name: "入宅",
        remark: "指某人搬入新居，也就是搬到新建的房屋内住"
    }, {
        name: "动土",
        remark: "指建造房屋时开始挖土，也泛指开始兴建土木等工程"
    }, {
        name: "开渠",
        remark: "‌指开凿水渠或河道，以便灌溉或排水"
    }, {
        name: "作梁",
        remark: "‌指砍伐树木制作屋顶梁木等事，是建筑房屋的重要步骤之一"
    }, {
        name: "构梁",
        remark: "‌指砍伐树木制作屋顶梁木等事，是建筑房屋的重要步骤之一"
    }, {
        name: "盖屋",
        remark: "‌指建造或修缮房屋，包括装盖房屋的屋顶等工作"
    }, {
        name: "作灶",
        remark: "‌指安修厨灶、厨炉移位等事。在中国传统文化中，厨房被视为家庭的重要场所，因此作灶也被认为是一件大事"
    }, {
        name: "造仓",
        remark: "指建造或修理仓库，用于储存粮食或其他物品。"
    }, {
        name: "掘井",
        remark: "指开凿水井、池塘，或者进行开渠、筑阴沟、开鱼池等与水源开发相关的工作。"
    } ]
}, {
    name: "祭祀",
    list: [ {
        name: "安葬",
        remark: "指将逝者遗体或骨灰安置在墓地中的仪式"
    }, {
        name: "行丧",
        remark: "指办理丧事的整个过程，包括报丧、吊唁、出殡等仪式"
    }, {
        name: "祭祀",
        remark: "‌指对祖先或神灵的祭祀仪式，以祈求保佑和庇护。"
    }, {
        name: "祈福",
        remark: "‌指向神灵祈求幸福、安康等美好愿望的活动。"
    }, {
        name: "安香",
        remark: "‌指将香烛等供品安置在神位或祖先牌位前的仪式，以表示敬意和祈求"
    }, {
        name: "求嗣",
        remark: "‌指祈求子孙繁衍、后代昌盛的活动。"
    }, {
        name: "入殓",
        remark: "‌指将逝者遗体放入棺材中的仪式"
    }, {
        name: "修坟",
        remark: "指对坟墓进行修缮、维护的活动"
    }, {
        name: "开光",
        remark: "指为佛像、神像等开眼的仪式，以赋予其灵性和神力"
    } ]
} ], exports.sizhuScore = {
    year: [ 8, 4 ],
    month: [ 12, 40 ],
    day: [ 0, 12 ],
    hour: [ 12, 12 ]
}, exports.wuxingRelationship = [ [ "木", "水木", "金火土" ], [ "火", "木火", "水土金" ], [ "土", "火土", "木金水" ], [ "金", "土金", "火水木" ], [ "水", "金水", "土木火" ] ], 
exports.zodiacEarthBranch = [ [ "鼠", "子" ], [ "牛", "丑" ], [ "虎", "寅" ], [ "兔", "卯" ], [ "龙", "辰" ], [ "蛇", "巳" ], [ "马", "午" ], [ "羊", "未" ], [ "猴", "申" ], [ "鸡", "酉" ], [ "狗", "戌" ], [ "猪", "亥" ] ];